Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: As long as it is 1, the counter's value is asynchronously pinned to 0.
ru_ru: Пока на нём 1, значение счётчика асинхронно фиксируется на 0.

source: Let's look again at where we were.
ru_ru: Давайте снова посмотрим туда, где мы находимся.

source: Wire colors
ru_ru: Цвета проводов

source: But just because it's on paper doesn't mean it's right.
ru_ru: Но то, что она на бумаге, ещё не означает, что она правильная.

source: The clear input resets the counter's value to 0 (all zeroes) asynchronously; that is, as long as the clr input is 1, the value is pinned to 0, regardless of the clock input.
ru_ru: Вход Очистка асинхронно сбрасывает значение счётчика на 0 (все нули); кроме того, пока на входе Очистка 1, значение фиксировано на 0 вне зависимости от тактового входа.

source: (Manufacturers vary as to how they map inputs to segments; the correspondence used here is based on Texas Instruments' TIL321.)
ru_ru: (Производители по-разному подводят входы к сегментам; соответствие, использованное здесь, основано на индикаторе TIL321 от Texas Instruments.)

source: The Inputs and Outputs tabs
ru_ru: Вкладки Входы и Выходы

source: The user cannot change the value without breaking this link between the subcircuit's state and the containing circuit's state, and Logisim will prompt the user to verify that breaking this link is actually desired.
ru_ru: Пользователь не может изменить значение, не нарушая эту связь между состоянием подсхемы и состоянием содержащей её схемы, и Logisim будет предлагать пользователю подтвердить, что он действительно хочет нарушить эту связь.

source: Label Location
ru_ru: Направление метки

source: Other components may extend the pop-up menu also.
ru_ru: Другие компоненты тоже могут расширять всплывающее меню.

source: The RAM component supports three different interfaces, depending on the Data Interface attribute.
ru_ru: Компонент ОЗУ поддерживает три интерфейса, в зависимости от значения атрибута Интерфейс данных.

source: If you are using circuits from a loaded Logisim library, those components are considered to be black boxes: The contents of the library's circuits are not included in the unique and recursive counts.
ru_ru: Если вы используете схемы из загруженной библиотеки Logisim, то эти компоненты считаются чёрными ящиками: содержимое схем библиотеки не включается в количество уникальных и подсчитанных рекурсивно.

source: German
ru_ru: Немецкий

source: This value can be edited in the attribute table or, using the text tool, on the canvas.
ru_ru: Это значение можно изменять в таблице атрибутов, или, используя Инструмент Текст, на холсте.

source: Get Circuit Statistics
ru_ru: Получить статистику схемы

source: In most respects, the probe component duplicates the functionality found in a Pin component configured as an output pin.
ru_ru: Во многих отношениях датчик дублирует функциональность, присущую компоненту Контакт, настроенному как выход.

source: The value found on the data bus is stored into memory whenever the ld input is 0.
ru_ru: Значение, поступившее на шину данных, записывается в память, когда значение на входе ld - 0.

source: Hovering your mouse over the entry should bring up a tool tip describing which type of error it was.
ru_ru: При наведении мыши на такое значение должна появится подсказка, описывающая, какой это был тип ошибки.

source: It is by Theldo Cruz Franqueira, a faculty member at Pontifícia Universidade Católica de Minas Gerais in Brazil.
ru_ru: Его выполнил Телдо Круз Франкуэйра, преподаватель Папского Католического Университета Минас-Жерайса в Бразилии.

source: Logisim is a powerful program, allowing you to build up and test huge circuits; this step-by-step process just scratches the surface.
ru_ru: Logisim - это мощная программа, позволяющая вам создавать и проверять огромные схемы; это пособие только прошлось по поверхности.

source: a warranty) and that users may redistribute the program under
ru_ru: гарантии), и что пользователи могут повторно распространять программу при

source: (The LED component is basically redundant with an output pin, except for a somewhat different appearance.
ru_ru: (Компонент Светодиод в основном повторяет поведение выходного контакта, за исключением несколько другого внешнего вида.

source: East edge, labeled < (output, bit width 1)
ru_ru: Восточный край, отмечен < (выход, разрядность равна 1)

source: Unlike the RAM component, the ROM component's current contents are stored as an attribute of the component.
ru_ru: В отличие от компонента ОЗУ, текущее содержимое компонента ПЗУ хранится в виде атрибута компонента.

source: West edge (inputs, bit width according to Data Bits attribute)
ru_ru: Западный край (входы, разрядность соответствует атрибуту Биты данных)

source: Logisim will prevent you from removing circuits that are used as subcircuits, and it will prevent you from removing the final circuit in a project.
ru_ru: Logisim не позволит вам удалить схемы, которые используются в качестве подсхем, и он не позволит вам удалить последнюю в проекте схему.

source: Clear: When this is 1, all stages are asynchronously reset to 0, and all other inputs are ignored.
ru_ru: Очистка: когда значение равно 1, все ступени асинхронно сбрасываются на 0, и все другие входы игнорируются.

source: Russian
ru_ru: Русский

source: Load next value
ru_ru: Загрузить следующее значение

source: The input is meant primarily for situations where you have multiple RAM units, only one of which would be enabled at any time.
ru_ru: Это вход предназначен в первую очередь для ситуаций, когда у вас есть несколько модулей памяти, только один из которых может быть включен в какой-то момент.

source: Create a rectangle with rounded corners through dragging from one corner to the opposite corner.
ru_ru: Создать прямоугольник со скруглёнными углами путём перетаскивания от одного угла до противоположного.

source: Delete
ru_ru: Удалить

source: When you click an existing wire segment using the Poke Tool, Logisim displays the current value traveling through that wire.
ru_ru: Когда вы щёлкаете на существующем сегменте провода, используя Инструмент Нажатие, Logisim показывает текущее значение, передаваемое через этот провод.

source: Beta 1 (in Gates library, moved to Wiring in 2.7.0)
ru_ru: Beta 1 (в библиотеке Элементы, перемещён в библиотеку Проводка в 2.7.0)

source: As an instructor, you might have had students complete an assignment: You have one file containing your solution, but you have several student files containing their work.
ru_ru: Как у преподавателя, у вас могут быть работы, выполненные учащимися: у вас есть один файл с вашим решением и несколько файлов учащихся, содержащих их работы.

source: When you e-mail me, please remember that I have worked hard to produce Logisim without receiving any payment from you.
ru_ru: Когда вы пишите мне, пожалуйста, помните, что я усердно работал над разработкой Logisim, не получая никакой оплаты от вас.

source: This is particularly likely if the class uses Logisim heavily, including many of the more advanced features, in which case the simple default configuration may prove too simple.
ru_ru: Это особенно вероятно, если курс интенсивно использует Logisim и многие его продвинутые возможности; в таком случае настройки по умолчанию могут оказаться слишком простыми.

source: Learning more
ru_ru: Дальнейшее изучение

source: To nail down what's going wrong, exploring what's going on in the subcircuits while running the overall circuit can help.
ru_ru: Найти, что идёт не так, может помочь просмотр происходящего в подсхеме во время работы всей схемы.

source: Copies the input on the west edge onto exactly one of the outputs on the east edge; which of these outputs is specified via the current value received through the input on the south edge.
ru_ru: Копирует значение со входа на западном крае строго на один из выходов на восточном крае; на какой из выходов производится копирование, определяется текущим значением, принятым на входе на южном крае.

source: They are displayed as folders in the explorer pane; to access a library's components, you have only to double-click the corresponding folder.
ru_ru: Они отображаются в виде папок в панели проводника; для доступа к компонентам библиотеки вам нужно дважды щёлкнуть соответствующую папку.

source: // These next two lines set it up so that the explorer window shows a
ru_ru: // Следующие две строчки настраивают его так, чтобы окно проводника показывало

source: * this class created, which manages all instances of the component.
ru_ru: * создан этим классом, и он управляет всеми экземплярами компонента.

source: Greek
ru_ru: Греческий

source: However, if the Alt key is pressed at a location not contained within any components, this initiates the addition of a new wire.
ru_ru: Кроме того, если клавиша Alt нажата в точке, не содержащейся внутри каких-либо компонентов, это инициирует добавление нового провода.

source: The maximum value, at which point the counter will set its carry output.
ru_ru: Максимальное значение, при котором счётчик установит в 1 значение выхода Перенос.

source: After analyzing a circuit, there is no continuing relationship between the circuit and the Combinational Analysis window.
ru_ru: После анализа схемы не остаётся никакой постоянной связи между схемой и окном Комбинационный анализ.

source: By placing a controlled buffer between each component output and the bus, you can control whether that component's output is fed onto the bus or not.
ru_ru: Размещая управляемый буфер между выходом каждого компонента и шиной, вы можете управлять тем, подаётся выход этого компонента на шину, или нет.

source: (The bottom two ones are lost.)
ru_ru: (Две нижние единицы потеряны.)

source: This is helpful when you need to connect points far apart in the circuit and a network of wires would make the circuit much more ugly.
ru_ru: Это полезно, когда нужно подключить точки, расположенные далеко друг от друга в схеме, а сеть проводов сделала бы схему более уродливой.

source: The attribute deals with the user interface only; it does not have any effect on how the pin behaves when the circuit layout is used as a subcircuit.
ru_ru: Этот атрибут имеет дело только с интерфейсом пользователя; он никак не влияет на поведение контакта, когда чертёж схемы использован как подсхема.

source: You won't see it on the screen.
ru_ru: Вы не увидите этого на экране.

source: The XOR and XNOR gates include an attribute titled Multiple-Input Behavior that allow them to be configured to use the Odd Parity and Even Parity behavior.
ru_ru: Элементы Исключающее ИЛИ и Исключающее ИЛИ-НЕ имеют атрибут, названный Многовходовое поведение, который позволяет настроить их на использование поведения элементов Нечётность и Чётность.

source: For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program.
ru_ru: Например, если патент не позволяет безвозмездное повторное распространение Программы всем, кто получил копии от вас непосредственно или через посредников, то единственным способом удовлетворить и патенту, и этой Лицензии будет ваш полный отказ от распространения Программы.

source: If no, characters outside the 7-bit ASCII character set are replaced with equivalents appropriate to the language; this would be useful for Java/OS combinations where such characters are not supported well.
ru_ru: При no символы вне 7-битного набора символов ASCII заменяются эквивалентами соответственно языку; это будет полезно для комбинаций Java/ОС, где такие символы не поддерживаются хорошо.

source: The next page of the guide describes the last two tabs, Expression and Minimized.
ru_ru: Следующая страница руководства описывает последние две вкладки: Выражение и Минимизация.

source: The Outputs tab works in exactly the same way as the Inputs tab, except of course it works with the list of outputs instead.
ru_ru: Вкладка Выходы работает в точности также, как вкладка Входы; конечно, за исключением того, что она работает со списком выходов.

source: Saves images as GIF files.
ru_ru: Сохраняет изображения в формате GIF.

source: For each split end, all bits for which Bit x refers to its index travels through that split end; the order of these bits is the same as their order within the combined end.
ru_ru: Для каждого разделённого конца атрибуты Бит x содержат номера битов, проходящих через данный разделённый конец; порядок этих битов тот же, что и в объединённом конце.

source: You can also see that the output value has changed to 1.
ru_ru: Вы также можете увидеть, что выходное значение сменилось на 1.

source: We really do need to store the
ru_ru: Нам действительно нужно хранить

source: The number of bits for the tunnel.
ru_ru: Количество битов тоннеля.

source: The Spring 2001 CSCI 150 classes at the College of Saint Benedict and Saint John's University, which used the most rudimentary versions of Logisim as it was being developed.
ru_ru: Выпуски весны 2001 CSCI 150 Колледжа святого Бенедикта и Университета Сент-Джон, которые использовали самые зачаточные версии Logisim, когда он был в стадии разработки.

source: The Window menu
ru_ru: Меню Окно

source: A module in general-education computer science surveys
ru_ru: Как элемент обзорного курса информатики в общеобразовательных учреждениях

source: The lower dataBits bits of the sum of the two values coming in the west edge, plus the cin bit.
ru_ru: Младшие битыДанных битов суммы двух значений, поступающих на западный край плюс бит cin.

source: This already tells us that the circuit already computes a 0 when both inputs are 0.
ru_ru: Это уже говорит нам о том, что схема уже вычисляет 0, когда на обоих входах 0.

source: Next: The File menu.
ru_ru: Далее: Меню Файл.

source: The behavior is summarized by the following tables.
ru_ru: Это поведение обобщено следующими таблицами.

source: The quotient will always be an integer so that
ru_ru: Частное всегда будет целым, таким, что

source: You can also shorten an existing wire segment using the Wiring Tool, using a drag that starts or ends at a terminus of the segment, and that overlaps the existing segment.
ru_ru: Вы также можете укоротить существующий сегмент провода с помощью Инструмента Проводка, используя перетаскивание, начинающееся в одном из концов сегмента и частично перекрывающее данный сегмент.

source: The Mouse tab allows you to configure these mappings.
ru_ru: Вкладка Мышь позволяет вам настроить эти привязки.

source: The clock toggles its output value on a regular schedule as long as ticks are enabled via the Simulate menu.
ru_ru: Тактовый генератор меняет значение на выходе по определённому расписанию, пока такты включены через меню Моделировать

source: Opens the help system to the Guide to Being a Logisim User.
ru_ru: Открывает справочную систему на руководстве "Как стать пользователем Logisim".

source: If any of the inputs are not 0/1 (either floating or error), then the display shows a dash ('-').
ru_ru: Если значения на каких-либо входах - не 0/1 (плавающее значение или значение ошибки), то индикатор показывает тире ('-').

source: Thus, if you change any pins in a circuit, you will also need to edit any circuits using it as a subcircuit.
ru_ru: Таким образом, при изменении контактов в схеме, вам также придётся изменять схемы, использующие её в качестве подсхемы.

source: Acknowledgements
ru_ru: Благодарности

source: The Selection tab allows you to select which values should be included in the log.
ru_ru: Вкладка Выбор позволяет вам выбрать, какие значения должны быть включены в журнал.

source: Step Simulation
ru_ru: Шаг моделирования

source: The Bit x attribute says which split end corresponds to bit x of the combined end.
ru_ru: Атрибут Бит x определяет, какой разъединённый конец соответствует биту x объединённого конца.

source: If the control input into the buffer changes to 1, then the controlled buffer would feed 1 into the tunnel, which would combine with 0 from the pin at bottom to result in an error value; thus, we would then see red wires feeding through all three tunnels.
ru_ru: Если значение на управляющем входе буфера изменится на 1, то управляемый буфер выдаст 1 в тоннель, которая совместится с 0 от контакта внизу, и это в результате даст значение ошибки; тогда мы увидим красные провода, идущие от всех тоннелей.

source: Clicking the register brings keyboard focus to the register (indicated by a red rectangle), and typing hexadecimal digits will change the value stored in the register.
ru_ru: Нажатие на регистре переводит фокус ввода клавиатуры на регистр (это отображается красным прямоугольником), и ввод шестнадцатеричных цифр будет менять значение, хранящееся в регистре.

source: Clicking a flip-flop using the Poke Tool toggles the bit stored in the flip-flop, unless the asynchronous set/reset inputs currently pin the flip-flop's value.
ru_ru: Щелчок на триггере с помощью Инструмента Нажатие переключают бит, хранящийся в триггере, если входы Асинхронный сброс/установка не фиксируют значение в данный момент.

source: Hex editor
ru_ru: Шестнадцатеричный редактор

source: received the program in object code or executable form with such
ru_ru: получили программу в объектном коде или в выполнимом виде с

source: South edge, right side (input, bit width 1)
ru_ru: Южный край, правая сторона (вход, разрядность равна 1)

source: Data input: At the instant that the clock value rises from 0 to 1, the register's value changes to the value of the D input at that instant.
ru_ru: Вход данных: в момент, когда значение на тактовом входе изменяется с 0 на 1, значение регистра меняется на значение входа D.

source: This component iterates through a pseudorandom sequence of numbers, which steps forward to the following number in the sequence each time the clock is triggered while the component is enabled.
ru_ru: Этот компонент перебирает псевдослучайную последовательность чисел, переходя к следующему числу в последовательности каждый раз, когда срабатывает тактовый вход, если компонент включен.

source: Remove removes the currently selected component in the selection.
ru_ru: Удалить удаляет компонент, выделенный в данный момент в выборке.

source: You can customize the behavior in other ways by listing one or more options, separated by commas.
ru_ru: Вы можете настроить поведение по-другому, перечислив один или более аргументов, разделённых запятыми.

source: Translations of Logisim into other languages are welcome!
ru_ru: Переводы Logisim на другие языки приветствуются!

source: Our circuit for a 4-to-1 multiplexer uses three copies of the 2-to-1 multiplexer, each drawn as a box with pins along the side.
ru_ru: Наша схема для мультиплексора 4-в-1 использует три копии мультиплексора 2-в-1, каждая из которых отрисована в виде коробки с контактами вдоль краёв.

source: Each file contains a circuit named 2-bit adder (it's important that the circuit to test be named exactly the same), whose appearance is the following.
ru_ru: Каждый файл содержит схему с названием 2-bit adder (важно, чтобы схема для проверки имела точно такое же название), эти схемы выглядят следующим образом.

source: As a result, if you drag the selection a second time, the wires previously at the location will not be left behind.
ru_ru: В результате, если вы перетащите выделение второй раз, то провода, бывшие в этом месте до этого, не будут оставаться на месте.

source: /* The ports are locations where wires can be connected to this
ru_ru: /* Порты - это места, где провода могут быть присоединены к этому

source: launch4j, from Grzegorz Kowalt
ru_ru: launch4j, от Григория Ковальта

source: The translation process does not require an understanding of Java.
ru_ru: Процесс перевода не требует понимания Java.

source: Contains classes related to data elements associated with components, such as the Bounds class for representing bounding rectangles or the Value class for representing values that can exist on a wire.
ru_ru: Содержит классы, связанные с элементами данных, связанных с компонентами, такие как класс Bounds для представления ограничивающих прямоугольников или класс Value для представления значений, которые может передавать провод.

source: Memory: Components that remember data, like flip-flops, registers, and RAM.
ru_ru: Память: компоненты, хранящие данные, такие как триггеры, регистры, и ОЗУ.

source: Opens a recently opened project in a new window without prompting the user to navigate through a file selection dialog.
ru_ru: Открывает недавно открытый проект в новом окне без приглашения пользователя к навигации через диалог выбора файла.

source: (Empty circuits are not displayed as options.)
ru_ru: (Пустые схемы не отображаются как варианты.)

source: NOR
ru_ru: ИЛИ-НЕ

source: NOT
ru_ru: НЕ

source: Base: Tools that are integral to using Logisim, though you probably won't need to dig into this library very often.
ru_ru: Базовые: инструменты, которые являются неотъемлемой частью использования Logisim, хотя вы, вероятно, не будете заглядывать в эту библиотеку очень часто.

source: * west and 15 pixels north of the mouse location.
ru_ru: * западнее и на 15 пикселей севернее положения мыши.

source: Gate Location
ru_ru: Положение затвора

source: Often the bit width is 1, and there is no way of changing that, but many of Logisim's built-in components include attributes allowing you to customize the bit widths of their inputs and outputs.
ru_ru: Часто разрядность равна 1, и нет никакого способа изменить это, но многие из встроенных компонентов Logisim включают атрибуты, позволяющие вам настроить разрядности их входов и выходов.

source: Typing hexadecimal digits will change the top address accordingly.
ru_ru: Ввод шестнадцатеричных цифр будет изменять верхний адрес.

source: Many manufactured chips have pins that behave as an input in some situations and as an output in others; you cannot construct such chips within Logisim (at least, in the current version).
ru_ru: Многие промышленные чипы имеют контакты, которые в некоторых ситуациях ведут себя как входы, а в других - как выходы; вы не можете создавать такие чипы в Logisim (по крайней мере, в текущей версии).

source: Each time you poke an input, its value will toggle.
ru_ru: Каждый раз, когда вы нажимаете на вход, его значение будет переключаться.

source: See poking memory in the User's Guide.
ru_ru: См. Нажатие на память в Руководстве пользователя.

source: Next: The Layout tab.
ru_ru: Далее: Вкладка Чертёж.

source: Next: Creating circuits.
ru_ru: Далее: Создание схем.

source: The multi-bit versions of each gate will perform its one-bit transformation bitwise on its inputs.
ru_ru: Многобитные версии каждого элемента будут выполнять свои однобитные преобразования над входами поразрядно.

source: This demonstrates
ru_ru: Он демонстрирует

source: So far, we have tested the first two rows of our truth table, and the outputs (0 and 1) match the desired outputs.
ru_ru: До сих пор мы проверяли первые две строки нашей таблицы истинности и значения на выходах (0 и 1) соответствовали желаемым результатам.

source: } else { // else flip bit just above last 1
ru_ru: } else { // иначе поменять бит сразу выше последней 1

source: If you want a right to complain about the software, then I would suggest shelling out the money for a competing program to Logisim.
ru_ru: Если вы хотите иметь право жаловаться на программу, то я предлагаю наскрести денег на программу, конкурирующую с Logisim.

source: This subclass has all the code involved
ru_ru: Этот подкласс содержит весь необходимый код.

source: load
ru_ru: загрузка
